---
kind: type
id: T:Autodesk.Revit.DB.Visual.GradientNoiseType
source: html/e0e03f6e-f8bf-4181-d5ec-2472de01bda1.htm
---
# Autodesk.Revit.DB.Visual.GradientNoiseType

The enumerated type representing the permitted values for the asset property "GradientNoise" from the "Gradient" schema.

## Syntax (C#)
```csharp
public enum GradientNoiseType
```